ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
/* Variable which holds the status of NAND config file */
extern volatile uint8_t gsCfgFileFoundFlag;
extern ADI_OSAL_SEM_HANDLE   lt_task_evt_sem;
extern bool usbd_get_cradle_disconnection_status();

/*!
 ****************************************************************************
 * @brief    To do init of user0 config app based on DCB/default fw lcfg
 * @param    None
 * @retval   None
*****************************************************************************/
static void init_user0_config_app_lcfg() {
  /* Check & Load from DCB USER0 BLK lcfg if lcfg is available in user0_blk_app_lcfg_dcb */
  if (user0_blk_get_dcb_present_flag()) {
      user0_config_app_lcfg_set_from_dcb();
  }

  /* Loading default or modified fw user0 config app lcfg */
  else
  {
    if( !user_applied_agc_up_th )
      user0_config_app_lcfg.agc_up_th  = USER0_CFG_AGC_UP_TH;
    else
      user_applied_agc_up_th = 0;

    if( !user_applied_agc_low_th )
      user0_config_app_lcfg.agc_low_th = USER0_CFG_AGC_LOW_TH;
    else
      user_applied_agc_low_th = 0;

    if( !user_applied_adv_timeout_monitor )
      user0_config_app_lcfg.adv_timeout_monitor  = USER0_CFG_ADV_TIMEOUT_MONITOR;
    else
      user_applied_adv_timeout_monitor = 0;

    if( !user_applied_hw_id )
      user0_config_app_lcfg.hw_id = USER0_CFG_HW_ID;
    else
      user_applied_hw_id = 0;

    if( !user_applied_exp_id )
      user0_config_app_lcfg.exp_id  = USER0_CFG_EXP_ID;
    else
      user_applied_exp_id = 0;

    if( !user_applied_adxl_start_time )
      user0_config_app_lcfg.adxl_start_time  = USER0_CFG_ADXL_START_TIME;
    else
      user_applied_adxl_start_time = 0;
    if( !user_applied_adxl_tON )
      user0_config_app_lcfg.adxl_tON  = USER0_CFG_ADXL_TON;
    else
      user_applied_adxl_tON = 0;
    if( !user_applied_adxl_tOFF )
      user0_config_app_lcfg.adxl_tOFF  = USER0_CFG_ADXL_TOFF;
    else
      user_applied_adxl_tOFF = 0;

    if( !user_applied_temp_start_time )
      user0_config_app_lcfg.temp_start_time  = USER0_CFG_TEMP_START_TIME;
    else
      user_applied_temp_start_time = 0;
    if( !user_applied_temp_tON )
      user0_config_app_lcfg.temp_tON  = USER0_CFG_TEMP_TON;
    else
      user_applied_temp_tON = 0;
    if( !user_applied_temp_tOFF )
      user0_config_app_lcfg.temp_tOFF  = USER0_CFG_TEMP_TOFF;
    else
      user_applied_temp_tOFF = 0;

    if( !user_applied_adpd_start_time )
      user0_config_app_lcfg.adpd_start_time  = USER0_CFG_ADPD_START_TIME;
    else
      user_applied_adpd_start_time = 0;
    if( !user_applied_adpd_tON )
      user0_config_app_lcfg.adpd_tON  = USER0_CFG_ADPD_TON;
    else
      user_applied_adpd_tON = 0;
    if( !user_applied_adpd_tOFF )
      user0_config_app_lcfg.adpd_tOFF  = USER0_CFG_ADPD_TOFF;
    else
      user_applied_adpd_tOFF = 0;

    if( !user_applied_eda_start_time )
      user0_config_app_lcfg.eda_start_time  = USER0_CFG_EDA_START_TIME;
    else
      user_applied_eda_start_time = 0;
    if( !user_applied_eda_tON )
      user0_config_app_lcfg.eda_tON  = USER0_CFG_EDA_TON;
    else
      user_applied_eda_tON = 0;
    if( !user_applied_eda_tOFF )
      user0_config_app_lcfg.eda_tOFF  = USER0_CFG_EDA_TOFF;
    else
      user_applied_eda_tOFF = 0;

    if( !user_applied_sleep_min )
      user0_config_app_lcfg.sleep_min  = USER0_CFG_SLEEP_MIN;
    else
      user_applied_sleep_min = 0;

    if( !user_applied_signal_threshold )
      user0_config_app_lcfg.signal_threshold  = USER0_CFG_SIGNAL_THRESHOLD;
    else
      user_applied_signal_threshold = 0;
  }

}

/*!
 ****************************************************************************
 * @brief    To write an LCFG parameter
 * @param    field: LCFG field that has to be written
 * @param    value: Value to be written
 * @retval   USER0_CONFIG_ERROR_CODE_t
 *****************************************************************************/
USER0_CONFIG_ERROR_CODE_t user0_config_app_write_lcfg(uint8_t field, uint16_t value) {
  if (field < USER0_CONFIG_LCFG_MAX) {
    switch (field) {
    case USER0_CONFIG_LCFG_AGC_UP_TH:
      user0_config_app_lcfg.agc_up_th = value;
      user_applied_agc_up_th = 1;
      break;
    case USER0_CONFIG_LCFG_AGC_LOW_TH:
      user0_config_app_lcfg.agc_low_th = value;
      user_applied_agc_low_th = 1;
      break;
    case USER0_CONFIG_LCFG_ADV_TIMEOUT_MONITOR:
      user0_config_app_lcfg.adv_timeout_monitor = value;
      user_applied_adv_timeout_monitor = 1;
      break;
    case USER0_CONFIG_LCFG_HW_ID:
      user0_config_app_lcfg.hw_id = value;
      user_applied_hw_id = 1;
      //Update hw_id in the System Info structure
      update_hw_id_in_system_info(user0_config_app_lcfg.hw_id);
      break;
    case USER0_CONFIG_LCFG_EXP_ID:
      user0_config_app_lcfg.exp_id = value;
      user_applied_exp_id = 1;
      break;
    case USER0_CONFIG_LCFG_ADXL_START_TIME:
      user0_config_app_lcfg.adxl_start_time = value;
      user_applied_adxl_start_time = 1;
      break;
    case USER0_CONFIG_LCFG_ADXL_TON:
      user0_config_app_lcfg.adxl_tON = value;
      user_applied_adxl_tON = 1;
    break;
    case USER0_CONFIG_LCFG_ADXL_TOFF:
      user0_config_app_lcfg.adxl_tOFF = value;
      user_applied_adxl_tOFF = 1;
    break;
    case USER0_CONFIG_LCFG_TEMP_START_TIME:
      user0_config_app_lcfg.temp_start_time = value;
      user_applied_temp_start_time = 1;
      break;
    case USER0_CONFIG_LCFG_TEMP_TON:
      user0_config_app_lcfg.temp_tON = value;
      user_applied_temp_tON = 1;
    break;
    case USER0_CONFIG_LCFG_TEMP_TOFF:
      user0_config_app_lcfg.temp_tOFF = value;
      user_applied_temp_tOFF = 1;
    break;
    case USER0_CONFIG_LCFG_ADPD_START_TIME:
      user0_config_app_lcfg.adpd_start_time = value;
      user_applied_adpd_start_time = 1;
      break;
    case USER0_CONFIG_LCFG_ADPD_TON:
      user0_config_app_lcfg.adpd_tON = value;
      user_applied_adpd_tON = 1;
    break;
    case USER0_CONFIG_LCFG_ADPD_TOFF:
      user0_config_app_lcfg.adpd_tOFF = value;
      user_applied_adpd_tOFF = 1;
    break;
    case USER0_CONFIG_LCFG_EDA_START_TIME:
      user0_config_app_lcfg.eda_start_time = value;
      user_applied_eda_start_time = 1;
      break;
    case USER0_CONFIG_LCFG_EDA_TON:
      user0_config_app_lcfg.eda_tON = value;
      user_applied_eda_tON = 1;
    break;
    case USER0_CONFIG_LCFG_EDA_TOFF:
      user0_config_app_lcfg.eda_tOFF = value;
      user_applied_eda_tOFF = 1;
    break;
    case USER0_CONFIG_LCFG_SLEEP_MIN:
      user0_config_app_lcfg.sleep_min = value;
      user_applied_sleep_min = 1;
      break;
    case USER0_CONFIG_LCFG_SIGNAL_THRESHOLD:
      user0_config_app_lcfg.signal_threshold = value;
      user_applied_signal_threshold = 1;
      break;
    }
    return USER0_CONFIG_SUCCESS;
  }
  return USER0_CONFIG_ERROR;
}

/*!
 ****************************************************************************
 * @brief    Read LCFG parameter
 * @param    index: LCFG field to be read
 * @param    value: Returned value corresponding LCFG value
 * @retval   USER0_CONFIG_ERROR_CODE_t
 *****************************************************************************/
USER0_CONFIG_ERROR_CODE_t user0_config_app_read_lcfg(uint8_t index, uint16_t *value) {
  if (index < USER0_CONFIG_LCFG_MAX) {
    switch (index) {
    case USER0_CONFIG_LCFG_AGC_UP_TH:
      *value = user0_config_app_lcfg.agc_up_th;
      break;
    case USER0_CONFIG_LCFG_AGC_LOW_TH:
      *value = user0_config_app_lcfg.agc_low_th;
      break;
    case USER0_CONFIG_LCFG_ADV_TIMEOUT_MONITOR:
      *value = user0_config_app_lcfg.adv_timeout_monitor;
      break;
    case USER0_CONFIG_LCFG_HW_ID:
      *value = user0_config_app_lcfg.hw_id;
      break;
    case USER0_CONFIG_LCFG_EXP_ID:
      *value = user0_config_app_lcfg.exp_id;
      break;
    case USER0_CONFIG_LCFG_ADXL_START_TIME:
      *value = user0_config_app_lcfg.adxl_start_time;
      break;
    case USER0_CONFIG_LCFG_ADXL_TON:
      *value = user0_config_app_lcfg.adxl_tON;
      break;
    case USER0_CONFIG_LCFG_ADXL_TOFF:
      *value = user0_config_app_lcfg.adxl_tOFF;
      break;
    case USER0_CONFIG_LCFG_TEMP_START_TIME:
      *value = user0_config_app_lcfg.temp_start_time;
      break;
    case USER0_CONFIG_LCFG_TEMP_TON:
      *value = user0_config_app_lcfg.temp_tON;
      break;
    case USER0_CONFIG_LCFG_TEMP_TOFF:
      *value = user0_config_app_lcfg.temp_tOFF;
      break;
    case USER0_CONFIG_LCFG_ADPD_START_TIME:
      *value = user0_config_app_lcfg.adpd_start_time;
      break;
    case USER0_CONFIG_LCFG_ADPD_TON:
      *value = user0_config_app_lcfg.adpd_tON;
      break;
    case USER0_CONFIG_LCFG_ADPD_TOFF:
      *value = user0_config_app_lcfg.adpd_tOFF;
      break;
      case USER0_CONFIG_LCFG_EDA_START_TIME:
      *value = user0_config_app_lcfg.eda_start_time;
      break;
    case USER0_CONFIG_LCFG_EDA_TON:
      *value = user0_config_app_lcfg.eda_tON;
      break;
    case USER0_CONFIG_LCFG_EDA_TOFF:
      *value = user0_config_app_lcfg.eda_tOFF;
      break;
    case USER0_CONFIG_LCFG_SLEEP_MIN:
      *value = user0_config_app_lcfg.sleep_min;
      break;
    case USER0_CONFIG_LCFG_SIGNAL_THRESHOLD:
      *value = user0_config_app_lcfg.signal_threshold;
      break;
    }
    return USER0_CONFIG_SUCCESS;
  }
  return USER0_CONFIG_ERROR;
}

/*!
 ****************************************************************************
 *@brief      User0 Config app lcfg Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t * type pointer
 *****************************************************************************/
static m2m2_hdr_t *user0_config_app_lcfg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, user0_config_app_lcfg_op_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, user0_config_app_lcfg_op_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, user0_config_app_lcfg_op_hdr_t, p_resp_payload);
    uint16_t reg_data = 0;

