ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
    gnUser0ConfigInitFlag = 1;

    user0_config_app_on_timer_start();

    /*Wake up the low touch task*/
    adi_osal_SemPost(lt_task_evt_sem);

    return 0;
  }
  return 1;
}

/*!
 ****************************************************************************
 * @brief  User0 config App Deinitialization
 * @param  None
 * @retval 0-->success 1-->fail(returned when it has been deinitialised already)
 ******************************************************************************/
int user0_config_app_deinit() {
  if (gnUser0ConfigInitFlag) {

    gUser0ConfigAppTimerUp = 0;
    gnUser0ConfigInitFlag = 0;

    return 0;
  }
  return 1;
}

/*!
 ****************************************************************************
 * @brief  user0 config app Timer event function,
 *         which is executed from the user0 config app task.
 * @param  None
 * @retval 0-->success
 ******************************************************************************/
int User0ConfigTimerEvent() {
  if (gUser0ConfigAppTimerUp) {
    /*Timer is up; check the new detected state*/
    gUser0ConfigAppTimerUp = 0;

    if (get_user0_config_app_state() != STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING) {
      gnUser0ConfigAppState = STATE_INTERMITTENT_MONITORING_STOP_LOG;
    }

    user0_config_app_on_timer_stop();
    adi_osal_SemPost(lt_task_evt_sem);  /*Wake up the low touch task*/

  } // if(gUser0ConfigAppTimerUp)
  return 0;
}

/*!
 ****************************************************************************
 * @brief     Function for handling the low touch Mode 3 on wrist detection
 *            timer time-out.
 * @details   This function will be called each time the ON-wrist detection timer
 *            expires.
 * @param[in] p_context - unused
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_wrist_timeout_handler(void *p_context) {
  NRF_LOG_INFO("User0 config ON wrist Timer expiry..");
  gUser0ConfigAppTimerUp = 1;
  adi_osal_SemPost(user0_config_app_evt_sem);
}

/*!
 ****************************************************************************
 * @brief     Function for the Timer initialization.
 * @details   Initializes the timer module. This creates and starts application
 *            timer for ON-wrist detection. This is the log duration for Mode3
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void on_timer_init() {
  ret_code_t err_code;

  // Create timers
  err_code = app_timer_create(
      &m_user0_config_app_on_timer_id, APP_TIMER_MODE_SINGLE_SHOT, user0_config_app_on_wrist_timeout_handler);

  APP_ERROR_CHECK(err_code);

  NRF_LOG_INFO("user0_config_app ON wrist Timer created");
}

/*!
 ****************************************************************************
 * @brief     Function for starting ON-wrist application timer.
 * @details   Timers are run after the scheduler has started.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_timer_start(void) {
  uint32_t time = 0;

  /* LT application has to be enabled, for the longest duration of the application
    that needs to be logged. Based on this, on timer needs to be configured for this
     timing */
  if((user0_config_app_lcfg.adxl_tON+user0_config_app_lcfg.adxl_start_time) > time)
    time = (user0_config_app_lcfg.adxl_tON+user0_config_app_lcfg.adxl_start_time);
  if((user0_config_app_lcfg.temp_tON+user0_config_app_lcfg.temp_start_time) > time)
    time = (user0_config_app_lcfg.temp_tON+user0_config_app_lcfg.temp_start_time);
  if((user0_config_app_lcfg.adpd_tON+user0_config_app_lcfg.adpd_start_time) > time)
    time = (user0_config_app_lcfg.adpd_tON+user0_config_app_lcfg.adpd_start_time);
  if((user0_config_app_lcfg.eda_tON+user0_config_app_lcfg.eda_start_time) > time)
    time = (user0_config_app_lcfg.eda_tON+user0_config_app_lcfg.eda_start_time);

  /* To the log duration time from above calculation,
  Give one sec extra, for the logging to complete, 12 sec extra which is the delay in the LT app to start up */
  time += (13);
  time = time*1000;//convert seconds to millisec

  // Start repeated timer
  ret_code_t err_code = app_timer_start(
      m_user0_config_app_on_timer_id, APP_TIMER_TICKS(time), NULL);
  APP_ERROR_CHECK(err_code);
}

/*!
 ****************************************************************************
 * @brief    Function for stopping ON-wrist application timer.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_timer_stop(void) {
  // Stop the repeated timer
  ret_code_t err_code = app_timer_stop(m_user0_config_app_on_timer_id);
  APP_ERROR_CHECK(err_code);
}
#endif

/*!
 ****************************************************************************
 * @brief    User0 Config task init function.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
void user0_config_app_task_init(void) {
  ADI_OSAL_STATUS eOsStatus;

  /* Create User0 Config app thread */
  g_user0_config_app_attributes.pThreadFunc = user0_config_app;
  g_user0_config_app_attributes.nPriority = APP_OS_CFG_USER0_CONFIG_APP_TASK_PRIO;
  g_user0_config_app_attributes.pStackBase = &ga_user0_config_app_stack[0];
  g_user0_config_app_attributes.nStackSize = APP_OS_CFG_USER0_CONFIG_APP_TASK_STK_SIZE;
  g_user0_config_app_attributes.pTaskAttrParam = NULL;
  g_user0_config_app_attributes.szThreadName = "user0_config_app";
  g_user0_config_app_attributes.pThreadTcb = &g_user0_config_app_tcb;

  eOsStatus = adi_osal_MsgQueueCreate(&gh_user0_config_app_msg_queue, NULL, 9);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_USER0_CONFIG_TASK_INDEX, gh_user0_config_app_msg_queue);
  }

  eOsStatus =
      adi_osal_ThreadCreateStatic(&gh_user0_config_app_handler, &g_user0_config_app_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  adi_osal_SemCreate(&user0_config_app_evt_sem, 0);

#ifdef CUST4_SM
  //ON detection Timer creation, for the log duration of LT App Mode3
  on_timer_init();
#endif
}

/*!
 ****************************************************************************
 * @brief User0 Config App task function
 * @param  arg - unused
 * @return none
 ******************************************************************************/
static void user0_config_app(void *arg) {
  ADI_OSAL_STATUS err;
  USER0_CONFIG_APP_STATE_t read_user0_config_app_state;

