ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
  UNUSED_PARAMETER(arg);

  /*Wait for FDS init to complete*/
  adi_osal_SemPend(user0_config_app_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  init_user0_config_app_lcfg();

#ifdef CUST4_SM
  read_user0_config_app_state = get_user0_config_app_state();

  /*After Watch reset, find previous state and set current state*/
  //if(read_user0_config_app_state == STATE_ADMIT_STANDBY)
  //if(read_user0_config_app_state == STATE_INTERMITTENT_MONITORING)
  //if(read_user0_config_app_state == STATE_END_MONITORING)
  //if(read_user0_config_app_state == STATE_CHARGING_BATTERY)
  //Do nothing

  if(read_user0_config_app_state == STATE_START_MONITORING)
  {
    user0_config_app_enter_state_admit_standby();
  }

  //Disconnected from cradle
  else if(read_user0_config_app_state == STATE_SLEEP
   && usbd_get_cradle_disconnection_status())
  {
    user0_config_app_enter_state_intermittent_monitoring();
  }

  //connected to cradle for charging
  else if((read_user0_config_app_state == STATE_SLEEP
   || read_user0_config_app_state == STATE_INTERMITTENT_MONITORING)
  && !usbd_get_cradle_disconnection_status())
  {
    user0_config_app_enter_state_end_monitoring();
  }

  //Disconnected from cradle
  else if((read_user0_config_app_state == STATE_INTERMITTENT_MONITORING_START_LOG
   || read_user0_config_app_state == STATE_INTERMITTENT_MONITORING_STOP_LOG)
   && usbd_get_cradle_disconnection_status())
  {
    user0_config_app_enter_state_intermittent_monitoring();
  }

  //connected to cradle for charging
  else if(read_user0_config_app_state == STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING
  && !usbd_get_cradle_disconnection_status())
  {
    user0_config_app_enter_state_end_monitoring();
  }

  //connected to cradle for charging
  else if(read_user0_config_app_state == STATE_OUT_OF_BATTERY_STATE_BEFORE_START_MONITORING
  && !usbd_get_cradle_disconnection_status())
  {
    user0_config_app_enter_state_admit_standby();
  }

  /* Force the current state to STATE_ADMIT_STANDBY incase of any unknown state */
  else if( read_user0_config_app_state != STATE_ADMIT_STANDBY &&
      read_user0_config_app_state > STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING)
  {
    user0_config_app_enter_state_admit_standby();
  }
#endif

  while (1) {
    m2m2_hdr_t *p_in_pkt = NULL;
    m2m2_hdr_t *p_out_pkt = NULL;
    adi_osal_SemPend(user0_config_app_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_USER0_CONFIG_TASK_INDEX); //user0 conig app events

    // We got an m2m2 message from the queue, process it.
    if (p_in_pkt != NULL) {
      // We got an m2m2 message from the queue, process it.
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      // Look up the appropriate function to call in the function table
      for (int i = 0; i < USER0_CONFIG_APP_ROUTING_TBL_SZ; i++) {
        if (user0_config_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = user0_config_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    }
#ifdef CUST4_SM
    else
    {
      User0ConfigTimerEvent();
    }
#endif
  }
}

#ifdef CUST4_SM
/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_ADMIT_STANDBY

 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_state_admit_standby()
{
  set_user0_config_app_state(STATE_ADMIT_STANDBY);
  //TODO: Display Band No: and Experiment ID on LCD
  //TODO: Turn on the backlight of LCD
  //Turn BLE On
}

/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_START_MONITORING
 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_state_start_monitoring()
{
  set_user0_config_app_state(STATE_START_MONITORING);
  gn_intermittent_op_count=0;
  //TODO: Display Band No: and Experiment ID on LCD
  //TODO: Turn on the backlight of LCD
  //Turn BLE On
}

/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_SLEEP
 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_state_sleep()
{
  uint32_t sleep_time_secs;
  set_user0_config_app_state(STATE_SLEEP);
  //Do watch power down
  /* Set the RTC to give an interupt after comparing upto total of
   * Watch current time + sleep_min in lcfg
   */
  sleep_time_secs = (user0_config_app_lcfg.sleep_min * 60);
  enable_rtc_wakeup(sleep_time_secs);
  /*After Watch Operation, go to sleep mode */
  enter_poweroff_mode();
}

/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_INTERMITTENT_MONITORING
 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_state_intermittent_monitoring()
{
  /* Wait for FS task FindConfigFile() completes */
  adi_osal_SemPend(user0_config_app_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  //Change state after FS task updates the config file status
  set_user0_config_app_state(STATE_INTERMITTENT_MONITORING);

  //TODO: Display Band No: and Experiment ID on LCD
  //TODO: Turn off the backlight of LCD

  //Turn off BLE
  turn_off_BLE();
  //Change the BLE advertising duration as specified in user0 config DCB
  change_ble_adv_duration(user0_config_app_lcfg.adv_timeout_monitor);

  // On Bootup Enable User0 Config app if user0 config cfg files are present
  if( get_low_touch_trigger_mode3_status() &&
      (gen_blk_get_dcb_present_flag() || gsCfgFileFoundFlag) )
  {
      user0_config_app_init(true);
      /* Increment debug variable to count no: of times intermittent
         operation is done */
      gn_intermittent_op_count++;
  }
  else
      user0_config_app_deinit(false);
}

/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_END_MONITORING
 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_state_end_monitoring()
{
  set_user0_config_app_state(STATE_END_MONITORING);
  //TODO: Display Band No: and Experiment ID on LCD
  //TODO: Turn on the backlight of LCD
}

/*!
 ****************************************************************************
 * @brief  Function which changes the state  of User0 Config App task function
 *         to STATE_CHARGING_BATTERY
 * @param  None
 * @return None
 *****************************************************************************/
void user0_config_app_enter_charging_battery()
{
  set_user0_config_app_state(STATE_CHARGING_BATTERY);
  //TODO: Display Band No: and Experiment ID on LCD
  //TODO: Turn off the backlight of LCD
}
#endif

/*!
 ****************************************************************************
 * @brief  Function to send PO pkts to user0 config app task
 * @param  p_pkt m2m2 packet to be send to user0 config app task
 * @return None
 *****************************************************************************/
void send_message_user0_config_app(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  if(p_pkt != NULL)
  {
    osal_result = adi_osal_MsgQueuePost(gh_user0_config_app_msg_queue, p_pkt);
    if (osal_result != ADI_OSAL_SUCCESS)
      post_office_consume_msg(p_pkt);
  }
  adi_osal_SemPost(user0_config_app_evt_sem);
}

/*!
 ****************************************************************************
 * @brief  Function to check if ADXL App is configured for continuous operation
 *         from user0 config app lcfg (default fw/DCB)
 * @Desc   Continuous operation is when sleep_min=tON=tOFF=0
 * @param  None
 * @return True:  ADXL App is configured for continuous operation
 *         False: ADXL App is NOT configured for continuous operation
 *
 ****************************************************************************/
bool is_adxl_app_mode_continuous()
{
  if((user0_config_app_lcfg.adxl_tON==0) &&
     (user0_config_app_lcfg.adxl_tOFF==0) &&
     (user0_config_app_lcfg.sleep_min==0))
    return true;
  else
    return false;
}

/*!
 ****************************************************************************
 * @brief  Function to get ADXL App timings from user0 config app lcfg
 *         (default fw/DCB)
 * @param  start_time: start time of App, tON: On time of app in secs
 *         tOFF: Off time of app in secs
 * @return None
 *
 ****************************************************************************/
void get_adxl_app_timings_from_user0_config_app_lcfg(uint16_t *start_time, \
              uint16_t *tON, uint16_t *tOFF)
{
  *start_time = user0_config_app_lcfg.adxl_start_time;
  *tON = user0_config_app_lcfg.adxl_tON;
  *tOFF = user0_config_app_lcfg.adxl_tOFF;
}

/*!
 ****************************************************************************
 * @brief  Function to check if Temp App is configured for continuous operation
 *         from user0 config app lcfg (default fw/DCB)
 * @Desc   Continuous operation is when sleep_min=tON=tOFF=0
 * @param  None
 * @return True:  Temp App is configured for continuous operation
 *         False: Temp App is NOT configured for continuous operation
 *
 ****************************************************************************/
bool is_temp_app_mode_continuous()
{
  if((user0_config_app_lcfg.temp_tON==0) &&
     (user0_config_app_lcfg.temp_tOFF==0) &&
     (user0_config_app_lcfg.sleep_min==0))
    return true;
  else
    return false;
}

/*!
 ****************************************************************************
 * @brief  Function to get Temp App timings from user0 config app lcfg
 *         (default fw/DCB)
 * @param  start_time: start time of App, tON: On time of app in secs
 *         tOFF: Off time of app in secs
 * @return None
 *
 ****************************************************************************/
void get_temp_app_timings_from_user0_config_app_lcfg(uint16_t *start_time, \
              uint16_t *tON, uint16_t *tOFF)
{
  *start_time = user0_config_app_lcfg.temp_start_time;
  *tON = user0_config_app_lcfg.temp_tON;
  *tOFF = user0_config_app_lcfg.temp_tOFF;
}

/*!
 ****************************************************************************
 * @brief  Function to check if ADPD App is configured for continuous operation
 *         from user0 config app lcfg (default fw/DCB)
 * @Desc   Continuous operation is when sleep_min=tON=tOFF=0
 * @param  None
 * @return True:  ADPD App is configured for continuous operation
 *         False: ADPD App is NOT configured for continuous operation
 *
 ****************************************************************************/
bool is_adpd_app_mode_continuous()
{
  if((user0_config_app_lcfg.adpd_tON==0) &&
     (user0_config_app_lcfg.adpd_tOFF==0) &&
     (user0_config_app_lcfg.sleep_min==0))
    return true;
  else
    return false;
}

/*!
 ****************************************************************************
 * @brief  Function to get ADPD App timings from user0 config app lcfg
 *         (default fw/DCB)
 * @param  start_time: start time of App, tON: On time of app in secs
 *         tOFF: Off time of app in secs
 * @return None
 *
 ****************************************************************************/
void get_adpd_app_timings_from_user0_config_app_lcfg(uint16_t *start_time, \
              uint16_t *tON, uint16_t *tOFF)
{
  *start_time = user0_config_app_lcfg.adpd_start_time;
  *tON = user0_config_app_lcfg.adpd_tON;
  *tOFF = user0_config_app_lcfg.adpd_tOFF;
}

/*!
 ****************************************************************************
 * @brief  Function to check if EDA App is configured for continuous operation
 *         from user0 config app lcfg (default fw/DCB)
 * @Desc   Continuous operation is when sleep_min=tON=tOFF=0
 * @param  None
 * @return True:  EDA App is configured for continuous operation
 *         False: EDA App is NOT configured for continuous operation
 *
 ****************************************************************************/
bool is_eda_app_mode_continuous()
{
  if((user0_config_app_lcfg.eda_tON==0) &&
     (user0_config_app_lcfg.eda_tOFF==0) &&
     (user0_config_app_lcfg.sleep_min==0))
    return true;
  else
    return false;
}

/*!
 ****************************************************************************
 * @brief  Function to get EDA App timings from user0 config app lcfg
 *         (default fw/DCB)
 * @param  start_time: start time of App, tON: On time of app in secs
 *         tOFF: Off time of app in secs
 * @return None
 *
 ****************************************************************************/
void get_eda_app_timings_from_user0_config_app_lcfg(uint16_t *start_time, \
              uint16_t *tON, uint16_t *tOFF)
{
  *start_time = user0_config_app_lcfg.eda_start_time;
  *tON = user0_config_app_lcfg.eda_tON;
  *tOFF = user0_config_app_lcfg.eda_tOFF;
}

/*!
 ****************************************************************************
 * @brief  Function to set the user0 config app lcfg to default fw values
 * @param  None
 * @return None
 *
 ****************************************************************************/
void user0_config_app_lcfg_set_fw_default()
{
    user0_config_app_lcfg.agc_up_th  = USER0_CFG_AGC_UP_TH;
    user0_config_app_lcfg.agc_low_th = USER0_CFG_AGC_LOW_TH;
    user0_config_app_lcfg.adv_timeout_monitor  = USER0_CFG_ADV_TIMEOUT_MONITOR;
    user0_config_app_lcfg.hw_id = USER0_CFG_HW_ID;
    user0_config_app_lcfg.exp_id  = USER0_CFG_EXP_ID;
    user0_config_app_lcfg.adxl_start_time  = USER0_CFG_ADXL_START_TIME;
    user0_config_app_lcfg.adxl_tON  = USER0_CFG_ADXL_TON;
    user0_config_app_lcfg.adxl_tOFF  = USER0_CFG_ADXL_TOFF;
    user0_config_app_lcfg.temp_start_time  = USER0_CFG_TEMP_START_TIME;
    user0_config_app_lcfg.temp_tON  = USER0_CFG_TEMP_TON;
    user0_config_app_lcfg.temp_tOFF  = USER0_CFG_TEMP_TOFF;
    user0_config_app_lcfg.adpd_start_time  = USER0_CFG_ADPD_START_TIME;
    user0_config_app_lcfg.adpd_tON  = USER0_CFG_ADPD_TON;
    user0_config_app_lcfg.adpd_tOFF  = USER0_CFG_ADPD_TOFF;
    user0_config_app_lcfg.eda_start_time  = USER0_CFG_EDA_START_TIME;
    user0_config_app_lcfg.eda_tON  = USER0_CFG_EDA_TON;
    user0_config_app_lcfg.eda_tOFF  = USER0_CFG_EDA_TOFF;
    user0_config_app_lcfg.sleep_min  = USER0_CFG_SLEEP_MIN;
    user0_config_app_lcfg.signal_threshold  = USER0_CFG_SIGNAL_THRESHOLD;

    //Update hw_id in the System Info structure
    update_hw_id_in_system_info(user0_config_app_lcfg.hw_id);
}

/*!
 ****************************************************************************
 * @brief  Function to set the User0 Config app lcfg to from user0_config_app_lcfg DCB
 * @param  None
 * @return None
 ****************************************************************************/
void user0_config_app_lcfg_set_from_dcb()
{
  load_user0_config_app_lcfg_dcb();
  copy_user0_config_from_user0_blk_dcb(&user0_config_app_lcfg);
  //Update hw_id in the System Info structure
  update_hw_id_in_system_info(user0_config_app_lcfg.hw_id);
}

