ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
  /*  Declare a pointer to the input packet payload */
  PYLD_CST(p_pkt, user0_config_app_id_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, user0_config_app_id_t, 0);
  if (NULL != p_resp_pkt) {

    /*  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, user0_config_app_id_t, p_resp_payload);

    switch(p_in_payload->id_sel)
    {
      case ID_HW_ID:
        id_index = USER0_CONFIG_LCFG_HW_ID;
        status = M2M2_USER0_CONFIG_APP_STATUS_OK;
        break;
      case ID_EXP_ID:
        id_index = USER0_CONFIG_LCFG_EXP_ID;
        status = M2M2_USER0_CONFIG_APP_STATUS_OK;
        break;
      default:
        //Didnt get matching id index
        status = M2M2_USER0_CONFIG_APP_STATUS_ERR_ARGS;
        break;
    }

    switch(p_in_payload->id_op)
    {
      case ID_OPERATION_MODE_READ:

        //Found matching id index
        if(M2M2_USER0_CONFIG_APP_STATUS_OK == status)
        {
          if (GET_ID_SUCCESS == get_id_num(id_index, &p_resp_payload->id_num)) {
            status = M2M2_USER0_CONFIG_APP_STATUS_OK;
          } else {
            status = M2M2_USER0_CONFIG_APP_STATUS_ERR_ARGS;
          }
        }
        p_resp_payload->id_op = ID_OPERATION_MODE_READ;
        break;

      case ID_OPERATION_MODE_WRITE:
        //Found matching id index
        if(M2M2_USER0_CONFIG_APP_STATUS_OK == status)
        {
          if (GET_ID_SUCCESS == set_id_num(id_index, p_in_payload->id_num)) {
            status = M2M2_USER0_CONFIG_APP_STATUS_OK;
          } else {
            status = M2M2_USER0_CONFIG_APP_STATUS_ERR_ARGS;
          }
        }
        p_resp_payload->id_op = ID_OPERATION_MODE_WRITE;
        p_resp_payload->id_num = p_in_payload->id_num;
        break;

      case ID_OPERATION_MODE_DELETE:
        //Found matching id index
        if(M2M2_USER0_CONFIG_APP_STATUS_OK == status)
        {
          if (GET_ID_SUCCESS == set_id_num(id_index, 0)) {
            status = M2M2_USER0_CONFIG_APP_STATUS_OK;
          } else {
            status = M2M2_USER0_CONFIG_APP_STATUS_ERR_ARGS;
          }
        }
        p_resp_payload->id_op = ID_OPERATION_MODE_DELETE;
        p_resp_payload->id_num = 0;//Clearing the exp_id information
        break;
      default:
        p_resp_payload->id_op = p_in_payload->id_op;
        p_resp_payload->id_num = p_in_payload->id_num;
        status = M2M2_USER0_CONFIG_APP_STATUS_ERR_ARGS;
        break;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_USER0_CONFIG_APP_COMMAND_ID_OP_RESP;
    p_resp_payload->id_sel = p_in_payload->id_sel;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;

  }//if (NULL != p_resp_pkt)

  return p_resp_pkt;
}
#endif // DCB
#endif//USER0_CONFIG_APP